seguridad-informatica-smr2dual/apuntes/1/SI-T-01-Introduccion-a-la-seguridad-informatica.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="es" xml:lang="es">
<head>
<!-- 2017-10-03 mar 17:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Introducción a la seguridad informática</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Álvaro González Sotillo" />
</head>
<body>
<div id="content">
<h1 class="title">Introducción a la seguridad informática</h1>
<div id="table-of-contents">
<h2>&Iacute;ndice</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf19fe6f">1. Presentación del tema</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgf19fe6f" class="outline-2">
<h2 id="orgf19fe6f"><span class="section-number-2">1</span> Presentación del tema</h2>
<div class="outline-text-2" id="text-1">
<p>
En este tema hablaremos de los conceptos básicos de la Seguridad Informática.
</p>

<p>
No son conceptos nuevos ni creados a propósito para ésta disciplina.
</p>

<p>
La mayor parte de ésta terminología ha sido adoptada de terminología ya existente en el ámbito empresarial, referida a la seguridad en un concepto amplio.
</p>

<p>
La Seguridad Informática se encarga de los aspectos relacionados con la seguridad de los equipos informáticos, pero también de todo lo que le rodea de manera más o menos directa: personas, datos, software, instalaciones&#x2026;
</p>
</div>

<div id="outline-container-org8352eb5" class="outline-3">
<h3 id="org8352eb5"><span class="section-number-3">1.1</span> Sistemas de información y sistemas informáticos.</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orgc2730df" class="outline-4">
<h4 id="orgc2730df"><span class="section-number-4">1.1.1</span> Sistema de información:</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Un sistema de información es un conjunto de elementos organizados, relacionados y coordinados entre sí, encargados de facilitar el funcionamiento global de una empresa o de cualquier otra actividad humana para conseguir sus objetivos.
</p>

<p>
Esos elementos son:
</p>

<ul class="org-ul">
<li>Recursos, como ordenadores, componentes, periféricos, conexiones, aplicaciones, sistemas operativos, y otros recursos no necesariamente informáticos, desde un teléfono a una grapadora.</li>

<li>Equipo humano</li>

<li>Información: datos organizados que tienen un significado. Pueden estar en un soporte informático o no.</li>

<li>Actividades: muy importante&#x2026; toda organización realiza varias actividades en su negocio. (Ej.: una pequeña tienda tiene varias actividades: vender productos a los clientes, hacer pedidos a los proveedores, controlar la cantidad de productos almacenados, gestionar los gastos, ingresos, impuestos, etc&#x2026;)</li>
</ul>
</div>
</div>

<div id="outline-container-org14717eb" class="outline-4">
<h4 id="org14717eb"><span class="section-number-4">1.1.2</span> Sistema informático:</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
Un Sistema informático está formado por un conjunto de elementos físicos (hardware, conexiones, cables&#x2026;) lógicos (Software de aplicación, de base, protocolos) y también podemos considerar con frecuencia al componente humano.
</p>

<p>
Un sistema informático <b>da soporte a las actividades de los sistemas de información</b>. Las empresas diseñan sus actividades conforme a la información que manejan&#x2026; Nunca pensando en el sistema informático que les va a dar soporte. Lo importante para ellas, lógicamente, es que esas actividades se desarrollen de manera ordenada, eficaz y eficiente. Los sistemas informáticos, cuando están bien diseñados y utilizados, contribuyen en esos aspectos. (INFORMÁTICA=Tratamiento autoMÁTICO de la INFORmación).
</p>

<p>
No necesariamente todas las actividades de la empresa requieren de sistemas informáticos.
</p>
</div>
</div>
</div>

<div id="outline-container-org24bc28f" class="outline-3">
<h3 id="org24bc28f"><span class="section-number-3">1.2</span> Seguridad</h3>
<div class="outline-text-3" id="text-1-2">
<p>
La seguridad es la disciplina que se ocupa de diseñar las <b>normas, procedimientos, métodos y técnicas</b> destinados a conseguir un sistema de información seguro y confiable.
</p>

<p>
Todos los elementos que participan en un sistema de información pueden verse afectados por factores de diversa índole que pueden poner en peligro su estabilidad y normal funcionamiento.
</p>

<p>
Con respecto a la Seguridad Informática, debemos tener en cuenta, que de todos esos elementos, debemos poner especial atención en la <b>información,</b> pues es el elemento más sensible de la empresa, y la que tiene un valor <i>incalculable</i> [1]&#x2026; pero siempre por detrás, por supuesto, de la seguridad de las personas.
</p>

<p>
Reflexiona sobre ésto: ¿Tendría sentido anteponer la seguridad de la información o de cualquier otro elemento a la seguridad de las personas?
</p>

<p>
Nuestro trabajo se centrará en la seguridad de los sistemas informáticos, pero siempre teniendo en mente que la protección va encaminada hacia las <b>actividades</b> de una empresa&#x2026; a intentar que no se vean vulneradas o afectadas por ninguna circunstancia, y por supuesto, tampoco la información que manejan. Es decir, a que los <i>sistemas de información</i> continúen su ritmo con la máxima normalidad posible. Para ello actuamos sobre los sistemas informáticos que les dan soporte.
</p>

<p>
Nuestra disciplina se encarga poco de la seguridad de las personas, por eso no tendrá especial relevancia. Eso no significa que sea, sin duda, el aspecto clave de la seguridad&#x2026; simplemente, que ésta disciplina se enfoca principalmente hacia la seguridad de los sistemas de información.
</p>

<p>
Para afrontar la seguridad de un sistema, deberemos conocer los elementos del sistema, los peligros que pueden acechar y las medidas que deberían adoptarse para lograr esa seguridad. No obstante, lo estudiaremos desde un punto de vista formal, utilizando terminología estándar del sector de la seguridad.
</p>

<p>
Reflexiona sobre ésto: ¿Se puede lograr la seguridad total? Es decir&#x2026; estar totalmente protegido contra cualquier cosa.
</p>

<p>
Hay un dicho en el sector de la seguridad:
</p>

<p>
<i><b>La cadena siempre se rompe por el eslabón más débil.</b></i>
</p>

<p>
A menudo se dice también que ese eslabón suele implicar al factor humano.
</p>

<p>
Reflexiona sobre ésto:¿Crees que en efecto, el factor humano es el eslabón más débil?
</p>
</div>
</div>



<div id="outline-container-org2a56a6b" class="outline-3">
<h3 id="org2a56a6b"><span class="section-number-3">1.3</span> Propiedades de un sistema de información seguro.</h3>
<div class="outline-text-3" id="text-1-3">
<p>
¿Qué le pedimos a un sistema de información seguro? ¿Que no se cuelgue? ¿Que no nos borre cosas? ¿Que no lo puedan hackear?&#x2026;. Si&#x2026; por supuesto. Estas cosas y muchas otras más. Formalmente hablando, hay tres <i>propiedades</i> básicas que un sistema de información debe mantener al máximo que sea posible. Prácticamente todo lo que le pidamos a un sistema de información que consideremos seguro cae dentro de mantener estas tres propiedades altas:
</p>
</div>

<div id="outline-container-orgf12ac41" class="outline-4">
<h4 id="orgf12ac41"><span class="section-number-4">1.3.1</span> INTEGRIDAD:</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
Garantizar la autenticidad y precisión de la información, sin importar el momento en que se solicita.
</p>

<p>
Dicho de otra forma, que los datos no son alterados ni destruidos de modo no autorizado, ni accidentalmente. Si los datos se pierden, se borran, se modifican, se corrompen, o se añaden datos nuevos fraudulentos o erróneos consideramos que se ha perdido la integridad de un sistema de información. Esto puede ocurrir con datos que están almacenados (“quietos”, en un fichero, o base de datos, o manejados por una aplicación&#x2026;) o con datos que se está en un sistema de comunicaciones (se están “moviendo”&#x2026; y llegan a su destino en un estado diferente al que fueron emitidos.
</p>
</div>
</div>

<div id="outline-container-org11c33e0" class="outline-4">
<h4 id="org11c33e0"><span class="section-number-4">1.3.2</span> CONFIDENCIALIDAD:</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
Garantizar que los datos almacenados estén únicamente al alcance de las personas, entidades o mecanismos autorizados, en los momentos autorizados y de una manera autorizada.
</p>

<p>
Es decir, no sólo que se pueda acceder a información si se está autorizado, sino que se además, debe hacerse dentro de la actividad correspondiente.
</p>

<p>
Si un sistema de información permite que un dato cualquiera llegue a ser visto por alguien que no está autorizado supone una pérdida de la confidencialidad. El concepto va todavía más lejos&#x2026; Si el dato llega a una persona que sí es un destinatario legítimo de la información, pero llega por un mecanismo no autorizado, o un momento no autorizado, o utilizando algún procedimiento no autorizado, también consideramos que se ha producido una pérdida de la confidencialidad.
</p>
</div>
</div>

<div id="outline-container-org1332bbe" class="outline-4">
<h4 id="org1332bbe"><span class="section-number-4">1.3.3</span> DISPONIBILIDAD:</h4>
<div class="outline-text-4" id="text-1-3-3">
<p>
El grado en que un dato está en el lugar, momento y forma en que es requerido por un usuario autorizado.
</p>

<p>
Dicho de otro modo, que la información que se solicite esté disponible en un periodo de tiempo "razonable" desde que se solicita por un usuario autorizado.
</p>

<p>
La pérdida de la disponibilidad sólo implica en sí misma que en un momento dado, una información que se solicita no es devuelta por un sistema. Esto no implica que la información haya perdido la integridad&#x2026; sólo que no se puede proporcionar en ese momento.
</p>
</div>
</div>


<div id="outline-container-org5d7d12c" class="outline-4">
<h4 id="org5d7d12c"><span class="section-number-4">1.3.4</span> Otras propiedades de seguridad.</h4>
<div class="outline-text-4" id="text-1-3-4">
<p>
Además de las tres propiedades fundamentales de un sistema de información seguro (la disponibilidad, confidencialidad e integridad), y de la cualidad de no-repudio, a menudo se utilizan otras propiedades de seguridad en algunos sistemas, según sean útiles o no:
</p>

<ul class="org-ul">
<li><b>No repudio</b>: La capacidad de determinar quién creó, modificó o accedió a cierta información, de forma que ni el emisor/creador pueda negar su participación, ni el receptor pueda negar que tuvo dicha información disponible.
Esta característica de la seguridad cobra importancia a la hora de realizar transacciones seguras en un sistema informático, con aplicaciones variadas. Por ejemplo, en la administración electrónica, es vital que el ciudadano pueda probar que ha tramitado en plazo sus obligaciones tributarias, y que el estado no pueda alegar que no recibió la documentación.</li>
</ul>


<ul class="org-ul">
<li><b>Autenticación</b>: Más allá de la confidencialidad, las medidas o servicios de autenticación intentan garantizar la identidad de las personas o entidades que intentan acceder a la información. Se puede exigir la autenticación en el origen de los datos, en el destino o en ambas. Está ligada a la <b>confidencialidad</b>, ya que el sistema informático necesita saber quién accede al sistema para garantizar esta última. Se necesita para el <b>no-repudio</b>.</li>

<li><b>Control de acceso</b>: Son las medidas o servicios que no sólo permiten o impiden el acceso de personas o entidades a la información, sino que además, suelen registrar constancia del hecho del acceso o el intento de acceso. Relacionado con la <b>confidencialidad</b> y el <b>no-repudio</b>.</li>
</ul>
</div>
</div>
</div>



<div id="outline-container-org57c25a7" class="outline-3">
<h3 id="org57c25a7"><span class="section-number-3">1.4</span> Medidas de seguridad. Clasificaciones.</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Para proteger la información, es necesario establecer una serie de medidas. Las medidas de seguridad pueden clasificarse de varias maneras. Nosotros vamos a mencionar dos:
</p>
</div>

<div id="outline-container-orgd1ae81d" class="outline-4">
<h4 id="orgd1ae81d"><span class="section-number-4">1.4.1</span> SEGURIDAD ACTIVA / SEGURIDAD PASIVA:</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
Atendiendo al carácter que tenga, hablamos de medidas de seguridad
</p>

<ul class="org-ul">
<li><b>Activas</b>: aquellas cuyo objetivo es evitar o reducir los riesgos que amenazan al sistema. Podemos decir que tienen un carácter <b>preventivo</b>. Intentan <i>impedir</i> que ocurra un incidente.
Por ejemplo, en un coche, el ABS es una medida de seguridad activa, ya que es un mecanismo electrónico que ayuda al conductor a frenar el coche&#x2026; intenta evitar, prevenir un incidente.</li>

<li><b>Pasivas</b>: aquellas cuyo objetivo es minimizar la repercusión de un incidente de seguridad una vez producido. Podemos decir que tienen un carácter <b>correctivo</b>.
No intentan evitar un incidente, sino reducir sus posibles efectos adversos. Por ejemplo, en un coche, un cinturón de seguridad es una medida de seguridad pasiva: no intenta evitar un accidente, sino que, de producirse, los daños para el ocupante del vehículo sean menores.</li>
</ul>

<p>
Una determinada medida de seguridad casi siempre cae en uno de los dos grupos. Es poco frecuente encontrar medidas de seguridad que simultáneamente puedan considerarse activas y pasivas&#x2026; no obstante, como haberlas, haylas. Por ejemplo, cualquiera de los antivirus modernos, por un lado intenta <i>impedir</i> la entrada de virus y malwares, y por otro lado, si entran y el antivirus los detecta intentará minimizar su impacto.
</p>
</div>
</div>

<div id="outline-container-orgfa9bfdc" class="outline-4">
<h4 id="orgfa9bfdc"><span class="section-number-4">1.4.2</span> SEGURIDAD FÍSICA / SEGURIDAD LÓGICA</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
Referido ya al ámbito exclusivo de la seguridad informática, podemos hablar de
</p>

<ul class="org-ul">
<li><b>Seguridad lógica</b>: cuando la medida va destinada a la protección de la información o del software.</li>

<li><b>Seguridad física</b>: cuando la medida va destinada a la protección del hardware.</li>
</ul>

<p>
Quizá estés pensando en el hecho de que el hardware, a veces es soporte del software y los datos&#x2026; Por ejemplo&#x2026; Si protejo un ordenador servidor con un SAI (el ordenador es hardware), pero el servidor en su interior contiene datos&#x2026; entonces ¿el SAI es una medida de seguridad física o lógica? Es física&#x2026; protege de manera directa al hardware&#x2026; y los datos del servidor también, pero de manera indirecta.
</p>

<p>
En general, el hardware en sí no es un recurso demasiado valioso. Hay medidas de seguridad física dirigidas a él porque prácticamente siempre es el soporte de los datos.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Autor: Álvaro González Sotillo</p>
<p class="date">Created: 2017-10-03 mar 17:46</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
